OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/experimental/adjointSimpleFoam_UF/referenceCase/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu [0 2 -1 0 0 0 0] 1;

CrossPowerLawCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
    nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
    m               m [0 0 1 0 0 0 0] 1;
    n               n [0 0 0 0 0 0 0] 1;
}

BirdCarreauCoeffs
{
    nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
    nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
    k               k [0 0 1 0 0 0 0] 0;
    n               n [0 0 0 0 0 0 0] 1;
}

lambda          lambda   [0 -2 1 0 0 0 0] 0.01;
alphaMax        alphaMax [0 0 -1 0 0 0 0] 2000.0;
alphaMean       alphaMean [0 0 -1 0 0 0 0] 666.666;
alphaFixed      alphaFixed [0 0 -1 0 0 0 0] 5.;

// ************************************************************************* //
