OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/experimental/adjointSimpleFoam_UF/referenceCase/system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method scotch;
numberOfSubdomains 8;
scotchCoeffs
{
}
